blog/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "content", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["author", "Test"], ["content", "Test"], ["created_at", "2022-07-01 00:42:06.098289"], ["updated_at", "2022-07-01 00:42:06.098289"], ["post_id", 1]]
---
  def create
    # Create associated model
    @comment = @post.comments.create(comment_params)

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Test!!!"], ["updated_at", "2022-07-01 00:42:10.500594"], ["id", 7]]
---
  def update
    @comment.update(comment_params)