blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @posts = Post.all

INSERT INTO "posts" ("title", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        @post = Post.new(post_params)
        @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "This is a post created directly from the browser, not using the console to try that anymore. Happy Coding!!"], ["updated_at", "2022-06-29 01:41:04.455394"], ["id", 3]]
---
    def update
        @post.update(post_params)